" Отключить совместимость с vi.
set nocompatible

" Загрузить плагины.
call pathogen#infect()

" Устанавливать размер отступа и загрузать плагины в зависимости от типа файла.
filetype indent plugin on

" Подсвечивать синтаксис файла.
syntax on

" Как хранить символы внутри Vim.
set encoding=utf-8

" Не делать swap файлы.
set noswapfile

" Для нормального удаления символов перевода строк, отступов и места, где
" произошел переход в режим вставки, в нормальном режиме.
set backspace=indent,eol,start

" При использовании авто-дополнения в командной строке показывать доступные
" варианты над командной строкой.
set wildmenu

" Размер табуляции в пробелах.
set tabstop=4
" Количество пробелов при добавлении табуляции.
set softtabstop=4
" Заменять табуляцию на пробелы.
set expandtab
" Количество пробелов, добавляемых командами >> и <<.
set shiftwidth=4

" Копировать отступ предыдущей строки.
set autoindent
" Вставить дополнительный уровень идентации в некоторых случаях.
set smartindent

" Заворачивать длинные строки.
set wrap

" Показывать номера строк.
set number
" Подсвечивать текущую строку.
set cursorline
" Отключить мигание экрана и бипа при отображении ошибок.
set noerrorbells visualbell t_vb=
autocmd GUIEnter * set visualbell t_vb=

"
set title
" Показывать информацию о текущей строке, колонке, виртуальной колонке и
" относительной позиции курсора в файле.
set ruler
" Показывать информацию о выполняемой операции на последней строке экрана.
set showcmd
" Формат показываемой информации в правом нижнем углу.
set rulerformat=%30(%=\:b%n%y%m%r%w\ %l,%c%V\ %P%)

" Сохраняет обновление экрана в буфер вместо прямого вывода на экран. Полезно
" для быстрого перемещения по файлу.
set lazyredraw

" Подсвечивать результаты поиска в процессе набора.
set incsearch
" Подсвечивать результаты поиска.
set hlsearch
" Глобальный флаг замены по умолчанию.
set gdefault
" Игнорировать регистр символов при поиске командами / и ?.
set ignorecase
" Если шаблон содержит заглавный символ, то он будет учтен.
set smartcase

" Нормальный режим по jj.
imap jj <Esc>
" По нажатию пробела выключить подсветку найденных шаблонов и очистить все
" выведенные сообщения.
nnoremap <silent> <Space> :nohlsearch<Bar>:echo<CR>
